source/_static/diagrams/journeys-cross-parts.d2
direction: right
n0: "a journey"
n1: "RecipeReader"
n2: "StackWalker"
n3: "ReframeReader"
n0 -> n1
n1 -> n2
n2 -> n3
